name: "multimodal_classifier"
platform: "onnxruntime_onnx"
max_batch_size: 32

input [
  {
    name: "img_emb"
    data_type: TYPE_FP32
    dims: [512]
  },
  {
    name: "txt_emb"
    data_type: TYPE_FP32
    dims: [768]
  }
]
output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [50]
  }
]

dynamic_batching {
  preferred_batch_size: [4, 8, 16]
  max_queue_delay_microseconds: 100
}

instance_group [
  {
    count: 1
    kind: KIND_CPU   # можно KIND_GPU, но у нас CPU
  }
]
